Tasks/Задачи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Task>
		<Properties>
			<Name>Задачи</Name>
			<Addressing>InformationRegister.ИсполнителиЗадач</Addressing>
			<BasedOn>
				<xr:Item>BusinessProcess.Задание</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Важность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыВажности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИсполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаИсполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПринятияКИсполнению</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсторияВыполнения</Name>
					<Comment>не используется</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонечнаяДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеобходимаПроверка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеЗадачи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодтвержденаПроверка</Name>
					<Comment>не используется</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредметЗадачи</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:TaskRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПринятВРаботу</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проверяющий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатИсполнения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатПроверки</Name>
					<Comment>не используется</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокИсполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаПродаж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТочкиПродаж</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<AddressingAttribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
			<AddressingAttribute>
				<Properties>
					<Name>РольИсполнителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РолиИсполнителей</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
		</ChildObjects>
	</Task>
</MetaDataObject>

InformationRegisters/УведомленияОНовыхЗадачах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>УведомленияОНовыхЗадачах</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УДАЛИТЬ_Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:TaskRef.Задачи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИсполнителиЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИсполнителиЗадач</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГруппаИсполнителейЗадач</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыИсполнителейЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>РольИсполнителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РолиИсполнителей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеПользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Tasks/Задачи/Forms/ФормаЗадачиЗадание/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Объект.БизнесПроцесс.Пустая() Тогда 
		Карта = Объект.БизнесПроцесс.Ссылка.ПолучитьОбъект().ПолучитьКартуМаршрута();
	КонецЕсли;
	
	Элементы.РезультатИсполнения.ТолькоПросмотр = ?(Объект.ТочкаМаршрута.Имя = "Выполнить", Ложь, Истина);
	
	Если Объект.ТочкаМаршрута.Имя = "Проверить" Тогда 
		Если Объект.Автор = ПараметрыСеанса.ТекущийПользователь или Объект.Проверяющий = ПараметрыСеанса.ТекущийПользователь Тогда 
			Элементы.РезультатПроверки.ТолькоПросмотр = Ложь;
			Элементы.ФормаВыполнитьИЗакрыть.Заголовок = "Принято, закрыть"; 
		Иначе
			Элементы.ФормаВыполнитьИЗакрыть.Доступность = Ложь;
			Элементы.ФормаАктивировать.Видимость = Ложь;
			Элементы.ФормаПеренаправить.Видимость = Ложь;
			Элементы.ФормаОтменено.Видимость = Ложь;
		КонецЕсли;
	Иначе
		Если не Объект.Автор = Пользователи.ТекущийПользователь() Тогда 					
			Элементы.ФормаОтменено.Видимость = Ложь;
		КонецЕсли;
		Элементы.РезультатПроверки.ТолькоПросмотр = Истина;	
		Элементы.ФормаВернутьИсполнителю.Видимость = Ложь;
	КонецЕсли;	
	
	//Элементы.ИзменитьЗадание.Видимость = (Объект.Автор = ПараметрыСеанса.ТекущийПользователь);	
	Если Объект.Ссылка.Пустая() Тогда
		ИнициализацияФормы();
	КонецЕсли;
	
	ЗаданиеОтменено = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) И ПриОткрытииНаСервере() Тогда 
		Записать();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ИнициализацияФормы();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ВыполнитьЗадачу = Ложь;
	Если НЕ (ПараметрыЗаписи.Свойство("ВыполнитьЗадачу", ВыполнитьЗадачу) И ВыполнитьЗадачу) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗаданиеВыполнено И НЕ ЗначениеЗаполнено(ТекущийОбъект.РезультатИсполнения) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru = 'Укажите причину, по которой задача отклоняется.'"),,
			"Объект.РезультатИсполнения",,
			Отказ);
		Возврат;
	КонецЕсли;
	
	// Запись объекта бизнес-процесса.
	УстановитьПривилегированныйРежим(Истина);
	ЗаданиеОбъект = ТекущийОбъект.БизнесПроцесс.ПолучитьОбъект();
	ЗаблокироватьДанныеДляРедактирования(ЗаданиеОбъект.Ссылка);
	ЗаданиеОбъект.Отменено = ЗаданиеОтменено;
	ЗаданиеОбъект.Записать();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ИнициализацияФормы()
	
	//НачальныйПризнакВыполнения = Объект.Выполнена;
	//ПрочитатьРеквизитыБизнесПроцесса();
	//УстановитьСостояниеЭлементов();
	
	//ИспользоватьДатуИВремяВСрокахЗадач = ПолучитьФункциональнуюОпцию("ИспользоватьДатуИВремяВСрокахЗадач");
	//Элементы.СрокНачалаИсполненияВремя.Видимость = ИспользоватьДатуИВремяВСрокахЗадач;
	//Элементы.ДатаИсполненияВремя.Видимость = ИспользоватьДатуИВремяВСрокахЗадач;
	//БизнесПроцессыИЗадачиСервер.УстановитьФорматДаты(Элементы.СрокИсполнения);
	//БизнесПроцессыИЗадачиСервер.УстановитьФорматДаты(Элементы.Дата);
	
	//БизнесПроцессыИЗадачиСервер.ФормаЗадачиПриСозданииНаСервере(ЭтотОбъект, Объект,
	//	Элементы.ГруппаСостояние, Элементы.ДатаИсполнения);
	//Элементы.ОписаниеРезультата.ТолькоПросмотр = Объект.Выполнена;
	
	Элементы.ИзменитьЗадание.Видимость = (Объект.Автор = Пользователи.ТекущийПользователь());
	Исполнитель = ?(ЗначениеЗаполнено(Объект.Исполнитель), Объект.Исполнитель, Объект.РольИсполнителя);
	
	//Если ПравоДоступа("Изменение", Метаданные.БизнесПроцессы.Задание) Тогда
	//	Элементы.Выполнено.Доступность = Истина;
	//	Элементы.Отклонено.Доступность = Истина;
	//Иначе
	//	Элементы.Выполнено.Доступность = Ложь;
	//	Элементы.Отклонено.Доступность = Ложь;
	//КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ОбработкаАктивации()
	Объект.ПринятВРаботу = Истина;
	Объект.ДатаНачалаИсполнения = ТекущаяДата();
	Записать();
КонецПроцедуры

&НаКлиенте
Процедура ВернутьИсполнителю(Команда)
	Объект.ПодтвержденаПроверка = Ложь;
	Записать();
	ВернутьИсполнителюНаСервере();	
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ВернутьИсполнителюНаСервере()
	Объект.Ссылка.ПолучитьОбъект().ВыполнитьЗадачу();
КонецПроцедуры

&НаСервере
Функция ПриОткрытииНаСервере()
	Если не Объект.ПринятВРаботу Тогда 
		Если Объект.ТочкаМаршрута.Имя = "Выполнить" и Объект.Исполнитель = ПараметрыСеанса.ТекущийПользователь Тогда 
			Объект.ПринятВРаботу = Истина;
			Объект.ДатаНачалаИсполнения = ТекущаяДатаСеанса();
		ИначеЕсли Объект.ТочкаМаршрута.Имя = "Проверить" и Объект.Проверяющий = ПараметрыСеанса.ТекущийПользователь Тогда 
			Объект.ПринятВРаботу = Истина;
			Объект.ДатаНачалаИсполнения = ТекущаяДатаСеанса();
		КонецЕсли;	
	КонецЕсли;
	Возврат Истина;
КонецФункции

//&НаСервере
//Функция ПолучитьПустогоСотрудника()
//	Возврат Справочники.Пользователи.ПустаяСсылка();
//КонецФункции

&НаКлиенте
Процедура ПеренаправитьЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ ТипЗнч(Результат) = Тип("Структура") Тогда
		Возврат;
	КонецЕсли; 
	
	Если ПеренаправитьНаСервере(Результат) Тогда
		Записать();	
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Перенаправить(Команда)
	
	//Сотрудник = ПолучитьПустогоСотрудника();
	//ОП = новый ОписаниеОповещения("ПеренаправитьЗавершение",Этаформа);
	//ПоказатьВводЗначения(ОП,Сотрудник);
	
	ТолькоИсполнитель = (Объект.ТочкаМаршрута = ПредопределенноеЗначение("БизнесПроцесс.Задание.ТочкаМаршрута.Проверить"));    
	
	МассивЗадач = Новый Массив;
	МассивЗадач.Добавить(Объект.Ссылка);
	
	ПараметрыФормы = Новый Структура("Задача,КоличествоЗадач,ЗаголовокФормы,ТолькоИсполнитель", 
		МассивЗадач[0], МассивЗадач.Количество(), 
		?(МассивЗадач.Количество() > 1, НСтр("ru = 'Перенаправить задачи'"), 
			НСтр("ru = 'Перенаправить задачу'")), ТолькоИсполнитель);
			
	Оповещение = Новый ОписаниеОповещения("ПеренаправитьЗавершение", ЭтотОбъект);
	ОткрытьФорму("Задача.Задачи.Форма.ПеренаправитьЗадачи", ПараметрыФормы, ЭтотОбъект,,,,Оповещение);
		
КонецПроцедуры

&НаСервере
Функция ПеренаправитьНаСервере(ВыбЗнач)
	
	Попытка
		Если Объект.ТочкаМаршрута = ПредопределенноеЗначение("БизнесПроцесс.Задание.ТочкаМаршрута.Выполнить") Тогда
			Объект.Исполнитель = ВыбЗнач.Исполнитель;
			Объект.РольИсполнителя = ВыбЗнач.РольИсполнителя;
			//Объект.Ответственный = ВыбЗнач;
			Исполнитель = ?(ЗначениеЗаполнено(Объект.Исполнитель), Объект.Исполнитель, Объект.РольИсполнителя);
			Текст = Формат(ТекущаяДатаСеанса(),"ДЛФ=DDT") + " " + ПараметрыСеанса.ТекущийПользователь + " назначил(а) нового исполнителя: " + Исполнитель;
			
		ИначеЕсли Объект.ТочкаМаршрута = ПредопределенноеЗначение("БизнесПроцесс.Задание.ТочкаМаршрута.Проверить") Тогда
			Объект.Проверяющий = ВыбЗнач.Исполнитель;
			//Объект.Ответственный = ВыбЗнач;
			Текст = Формат(ТекущаяДатаСеанса(),"ДЛФ=DDT") + " " + ПараметрыСеанса.ТекущийПользователь + " назначил(а) нового проверяющего: " + Объект.Проверяющий;
		КонецЕсли;
		
		Объект.ИсторияВыполнения = Объект.ИсторияВыполнения + "
		|" + Текст + "
		|";
		БП = Объект.БизнесПроцесс.Ссылка.ПолучитьОбъект();
		БП.ИсторияВыполнения = БП.ИсторияВыполнения +"
		|" + Текст + "
		|";
		БП.Записать();
		
		//запись в регистр напоминаний
		Если Объект.ТочкаМаршрута = ПредопределенноеЗначение("БизнесПроцесс.Задание.ТочкаМаршрута.Выполнить") Тогда
			НаборДанных = РегистрыСведений.УведомленияОНовыхЗадачах.СоздатьНаборЗаписей();
			//НаборДанных.Отбор.Ответственный.Установить(Объект.Ответственный);
			НаборДанных.Отбор.Задача.Установить(Объект.Ссылка);
			НаборДанных.Прочитать();
			НаборДанных.Очистить();
		
			//Движение = НаборДанных.Добавить();
			//Движение.Период = ТекущаяДатаСеанса();
			//Движение.Исполнитель = Объект.Ответственный;
			//Движение.Задача = Объект.Ссылка;
			//Движение.УДАЛИТЬ_Количество = 1;
			
			Если ЗначениеЗаполнено(Объект.РольИсполнителя) Тогда
				НаборИсполнителей = РегистрыСведений.ИсполнителиЗадач.СоздатьНаборЗаписей();
				НаборИсполнителей.Отбор.РольИсполнителя.Установить(Объект.РольИсполнителя);
				НаборИсполнителей.Прочитать();
				Для каждого ИсполнительРоли из НаборИсполнителей Цикл
					Движение = НаборДанных.Добавить();
					Движение.Период = ТекущаяДатаСеанса();
					Движение.Исполнитель = ИсполнительРоли.Исполнитель;
					Движение.Задача = Объект.Ссылка;
				КонецЦикла;
			ИначеЕсли ЗначениеЗаполнено(Объект.Исполнитель) Тогда
				Движение = НаборДанных.Добавить();
				Движение.Период = ТекущаяДатаСеанса();
				Движение.Исполнитель = Объект.Исполнитель;
				Движение.Задача = Объект.Ссылка;
			КонецЕсли;
			
			НаборДанных.Записать();
		КонецЕсли;
		
		Возврат Истина;
	Исключение
		Сообщить ("Переназначить задачу не удалось");
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции

&НаКлиенте
Процедура ИзменитьЗадание(Команда)
	
	Записать();
	ПоказатьЗначение(,Объект.БизнесПроцесс);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_Задание" Тогда
		Если Источник = Объект.БизнесПроцесс Тогда
			Прочитать();
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Отменено(Команда)
	
	ЗаданиеВыполнено = Ложь;
	ЗаданиеОтменено  = Истина;
	Если НЕ Записать(Новый Структура("ВыполнитьЗадачу", Истина)) Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьОповещениеПользователя("Задача отменена",
		ПолучитьНавигационнуюСсылку(Объект.Ссылка),
		Строка(Объект.Ссылка),
		БиблиотекаКартинок.Информация32);
	Закрыть();
	
КонецПроцедуры
